{
    "title": "Дома-Те",

    "unknownError": "Възникна някаква грешка.",
    "success": "Заявката беше изпълнена успешно.",
    "forbidden": "Достъпът отказан.",
    "illegalArgument": "Невалиден аргумент!",
    "illegalArguments": "Невалидни аргументи!",
    "missingArgument": "Липсва аргумент.",

    "loginMessages": {
        "name": "Потребителско име",
        "password": "Парола",
        "login": "Вход",

        "success": "Вие влязохте в профила си."
    },
    "signUpMessages": {
        "name": "Потребителско име",
        "password": "Парола",
        "repeatPassword": "Повтори парола",
        "signUp": "Регистрация",

        "success": "Вие се регистрирахте успешно. Моля влезте в акаунта си.",

        "differentPasswords": "Паролите не съвпадат.",
        "passwordAlreadyUsed": "Тази парола вече се използва."
    },
    "logoutMessage": "Вие излязохте от профила си",
    "formMessages": {
        "missingFields": "Не сте попълнили всички полета",
        "invalidToken": "Невалидна верификация. Моля опитайте отново.",
        "youAreAlreadyLoggedIn": "Влезли сте в профила си.",
        "youAreNotLoggedIn": "Не сте влезли в профила си.",
        "noAction": "Нищо не се случи. [звук на щурец]",
        "tooFast": "Моля, изчаквайте една-две секунди между действията си, за да не претоварите сървъра! Той не работи само за Вас."
    },

    "homePageContents": [
        {
            "topic": "Какво представлява Дома-Те?",
            "content": [
                "Дома-Те е уеб-приложение разработено от ученици по време на онлайн обучението.\n",
                "Целта е да предоставим на нашите преподаватели гъвкав и надежден метод \n",
                "за проверка на придобитите знания от учениците в електронната среда."
            ]
        },
        {
            "topic": "Как функционира Дома-Те?",
            "content": [
                "Преподавателите подготвят тестове, съставени от групи от въпроси с различна сложност,\n",
                "от които системата подбира на случаен принцип за всеки ученик или студент.\n",
                "По този начин за всеки се създава индивидуален вариант на теста.\n",
                "След предаване на тестовете преподавателите могат да преглеждат въпросите и отговорите на учениците."
            ]
        },
        {
            "topic": "Какво трябва да направите, за да го използвате?",
            "content": [
                "Да се регистрирате от менюто горе в дясно и да влезете в профила си.\n",
                "Това ще ви отведе директно в страницата за създаване и стартиране на тестове, ",
                "която включва подробни инструкция за употреба.\n",
                "При нужда от помощ можете да се свържете с нас от <a href=\"mailto:domate@abv.bg\" style=\"color:cyan;\">тук</a>."
            ]
        }
    ],
    "testsPageInstructions": {
        "main": [
            "Как се създава тест?",

            "За да създадете тест кликнете върху големия „плюс“. На екрана Ви се появява бланката на Вашия тест. Като кликнете върху теста се появяват 4 кръгчета. Като минете над тях се изписва каква дейност можете да извършите, като ги изберете. „Изтрии“ е за да изтриете дадения тест. „Редактирай“ е за да добавяте или премахвате задачи. „Раздай“ е за да раздадете избрания тест. „Провери“ е за да проверите отговорите на вашите ученици от теста.",

            "<hr />",
            "Като изберете „Раздай“ ще Ви изкочи поле, откъдето ще можете да отбележите от кога и до кога теста ще е достъпен и колко време на работа ще имат. Например теста ще е достъпен цял ден и учениците ще имат 40 минути за работа, след като минутите изтекат учениците няма да могат да пишат повече по теста. Бележката е лично за Вас, учениците при стартиране на теста ще виждат само името на теста, броя на въпросите и времето им за работа. Преди да стартират теста учениците трябва да отговорят на въпроса който сте записали.",
            "<hr />",
            "Като изберете „Провери“ ще Ви излезе поле в което ще видите всички пъти в който сте раздавали този тест. Например вчера сте пуснакали този тест на два класа - следователно ще имате 2 поленца със дати, час и други данни. Като изберете едно поле ще видите в табличен вид всички участници на този тест, колко време са работили и т.н. Задачите се появяват като кръгченца в различни цветове. Светло зелено - означава че системата го е оценила като грешен. Слетло червено - системата го е оценила като грешен. Сиво - когато отговора на ученика не е проверен (не е бил зададен отговор на задачата). Черно - когато ученика не е отговорил на този въпрос. Като изберете дадено кръгче ще Ви излезе поле в което е записано условието на задачата, която се е паднала на този ученик, неговия отговор и др информация. ",
            "<hr />",
            "Ако искате да излезете от профила си, минете с мишка върху домата, горе в дясно. Ще Ви се появи бутон за изход."
        ],
        "testEditor": [
            "Тук Вие можете да редактирате съдържанието на този тест.",

            "От дясно има поле в което можете да именувате този тест и да му добавите описание, за да можете да се ориентирате по-лесно. Отляво са групите от задачи с който разполагате в момента. В групите Вие можете да групирате задачите по някакъв общ критерии. Например по трудност на задачите, по класове, по учебен материал и т.н. За да създадете група трябва да изберете отново „плюса“. Като изберете появилата се група Ви се появяват 3 обции. „Изтрии“ - за да премахнете избраната група. „Добави“ - за да я добавите 1 задача от тази група към теста във който сте. След като сте добавили задача от дадена група се появява отдясно. Отдясно можете да размествате и да премахвате задачи от теста. Ако речем, че в една група имате 3 задачи и тази група я добавите 2 пъти към теста, означава че на всеки ученик по случаен принцип ще се паднат на теста му 2 задачи от всичките налични в групата. Ако добавите групата в теста повече пъти отколко броя на задачите, означава че на всички задачи от групата ще са във теста на всеки ученик и някои задачи ще се повтарят. От „Редактирай“ можете да редактирате избраната група.",

            "<hr />",
            "Ако искате да се върнете назад, изберете хиксчето горе вдясно или кликнете извън новопоявилото се поле. Всичко, което сте написали ще се запази."
        ],
        "groupEditor": [
            "Оттук можете да редактирате групата, която избрахте.",

            "Отдясно имате поле в което можете да именувате групата и да и сложите описание на съдържанието и. Отляво са всичките налични задачи. За да създадете задача трябва да изберете „плюса“. Като изберете появилото се поле Ви се появяват 3 обции за действие. „Изтрии“ за да изтриете задачата. „Добави“ за да добавите избраната задача към групата в която сте. Добавените задачи се появяват отдясно, откъдето можете и да ги премахвате. „Редактирай“ за да редактирате задачата.",

            "<hr />",
            "Ако искате да се върнете назад, изберете хиксчето горе вдясно или кликнете извън новопоявилото се поле. Всичко, което сте написали ще се запази. "

        ],
        "exerciseEditor": [
            "Създаване и редактиране на задача",

            "Отдясно можете да именувате избраната задача и да и сложите описание. Ако не напишете описание условието на задачата ще се появява като такова. Под описанието имате обцията да запишете правилния отговор, за да може системата да ви подпомогне после с проверяването. Долу отляво е разположено полето в което Вие въвеждате условието, а отгоре ще виждате как учениците ще виждат условието. Също така имате обцията да добавяте формули.", 

            "<hr />",
            "Ако искате да се върнете назад, изберете хиксчето горе вдясно или кликнете извън новопоявилото се поле. Всичко, което сте написали ще се запази."

        ]
    },
    "contentPlaceholders": {
        "noTestName": "<i style=\"opacity:0.5;\">Неименуван тест</i>",
        "noTestDescription": "<i style=\"opacity:0.5;\">Липсва описание</i>",

        "noGroupName": "<i style=\"opacity:0.5;\">Неименувана категория</i>",
        "noGroupDescription": "<i style=\"opacity:0.5;\">Липсва описание</i>",

        "noExerciseName": "<i style=\"opacity:0.5;\">Неименувана задача</i>",
        "noExerciseDescription": "<i style=\"opacity:0.5;\">Липсва описание</i>"
    },
    "successfulTestSchedule": "Насрочването на теста беше успешно. Моля споделете този линк с учениците си: \n $link",

    "joinTest": {
        "unknownTest": "Неопределен тест.",
        "notStartedYet": "Теста все още не е отворен.",
        "alreadyExpired": "Този тест вече приключи.",
        "notExisting": "Несъществуващо изпитване.",
        "sourceDeleted": "Преподавателят се е отказал от теста.",
        "alreadyJoined": "Вече участвате в този тест.",
        "youJoined": "Вие започнахте вашия тест."
    },

    "userClassErrorMessage": {
        "USER_ERRCODE_NO_ERROR": "Нямаше грешка.",
        "USER_ERRCODE_USER_ALREADY_EXIST": "Вече съществува такъв потребител.",
        "USER_ERRCODE_USER_DOES_NOT_EXIST": "Такъв потребител не съществува.",
        "USER_ERRCODE_ILLEGAL_USERNAME": "Потребителското име трябва да е между 3 и 16 символа и може да съдържа само букви, цифри, точка, тире и долна черта.",
        "USER_ERRCODE_ILLEGAL_PASSWORD": "Паролата трябва да съдържа между 6 и 72 символа.",
        "USER_ERRCODE_ILLEGAL_PASSWORD_OLD": "Паролата трябва да съдържа между 8 и 32 символа, поне една малка буква, поне една главна буква, поне една цифра и поне един специален знак.",
        "USER_ERRCODE_WRONG_PASSWORD": "Грешно потребителско име или парола."
    }
}
